<!DOCTYPE html> 
<html> 
	<head> <b>Introducere</b> </head> 
<body> 
<p>
    <div style="text-align:center;">
    <b>Software</b> r&#259;u inten&#355;ionat - de la Wikipedia, enciclopedia liber&#259;</div>
    Software-ul r&#259;u inten&#355;ionat (numit adesea malware, cuv&#226;nt englez pronun&#355;at, construit din sintagma malicious software, „software r&#259;uvoitor”) este un tip de 
    <a href='https://ro.wikipedia.org/wiki/Software' target='_blank' title='software'>software</a>
    proiectat inten&#355;ionat pentru deteriorarea unui 
    <a href='https://ro.wikipedia.org/wiki/Calculator' target='_blank' title='computer'>computer</a>
    computer sau infiltrarea &#238;n el, sau/&#351;i deteriorarea ori infiltrarea &#238;n &#238;ntregi re&#355;ele de computere, f&#259;r&#259; consim&#355;&#259;m&#226;ntul proprietarului respectiv. No&#355;iunea se utilizeaz&#259; generalizat de c&#259;tre informaticieni pentru a desemna orice form&#259; ostil&#259;, intruziv&#259; sau sup&#259;r&#259;toare de software sau cod de 
    <a href='https://ro.wikipedia.org/wiki/Program_(informatic%C4%83)' target='_blank' title='program'>program</a>.
    Termenul de 
    <a href='https://ro.wikipedia.org/wiki/Virus_informatic' target='_blank' title='virus'>virus</a>
    din domeniul computerelor este uneori utilizat pentru a desemna nu numai viru&#351;ii informatici, ci &#351;i toate formele de software r&#259;u inten&#355;ionat.     
</p>
<p>
    <div style="text-align:center;"><b>Exemple de software creat pentru furtul de informa&#355;ii</b></div>
<b>BANCOS</b>, un program care fur&#259; informa&#355;ii cu ocazia acces&#259;rii unui sit web bancar de c&#259;tre un client al b&#259;ncii <br>
<b>GATOR</b>, un program de tip „spion” care monitorizeaz&#259; obiceiurile la accesarea Internetului ale unor anumi&#355;i utilizatori &#351;i care apoi transmite datele unui 
<a href='https://ro.wikipedia.org/wiki/Server' target='_blank' title='server'>server</a>. Datele sunt folosite apoi pentru pentru a transmite acelui utilizator reclame conforme profilului s&#259;u.<br>
<b>LEGMIR</b>, program de tip „spion” care fur&#259; informa&#355;ii despre numele de utilizator, parole &#351;i altele, referitoare la jocuri online <br>
<b>QHOST</b>, un program de tip „cal troian” care modific&#259; fi&#351;ierele de pe serverul gazd&#259; pentru a redirec&#355;iona spre un alt server DNS, atunci c&#226;nd siturile bancare sunt accesate cu scopul de a fura informa&#355;iile de autentificare ale utilizatorului <br>
</p>
<p>
    <div style="text-align:center;"><b>Protec&#355;ie</b></div>
De obicei, programele anti-virus ruleaz&#259; automat pe fundal &#351;i monitorizeaz&#259; pentru probleme. C&#226;nd un virus este detectat, utilizatorul este avertizat c&#259; programul &#238;ncearca s&#259; introduc&#259; virusul &#238;n carantin&#259; sau s&#259;-l &#351;tearg&#259;.<br>
<b>Protec&#355;ie &#238;mpotriva spyware-ului</b> – Programele anti-spyware scaneaz&#259; pentru keyloggeri &#351;i alte tipuri de malware pentru a le &#238;ndep&#259;rta din calculator. <br>
<b>Protec&#355;ie &#238;mpotriva adware-ului</b> – Programele anti-adware caut&#259; aplica&#355;ii ce afi&#351;eaz&#259; reclame pe calculatorul dumneavoastr&#259;.<br>
<b>Protec&#355;ie &#238;mpotriva phishing-ului</b> – Programele anti-phishing blocheaz&#259; adresele IP ale site-urilor web de phishing cunoscute &#351;i avertizeaz&#259; utilizatorul &#238;n legatura cu site-uri web suspecte. <br>


</p>

</body> 
</html>
